tutorials/halfSphere/ChemicalEquilibriumMach50/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    location        system;
    object          sampleDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

setFormat    raw;

surfaceFormat           raw;

interpolationScheme cell;


fields
(
    p
);

surfaces
(
    obstacle
    {
        type            patch;
        patchName       obstacle;
    }
);



// *********************************************************************** //
